# Словник студентів - виконав Бобошко Вадим
students = {
    101: {
        "group": "КН-45-5/1",
        "name": "Бобошко Вадим Геннадійович",
        "course": 2,
        "subjects": {
            "Чисельні методи": 85,
            "Програмування": 90,
            "Сталий розвиток": 78
        }
    },
    102: {
        "group": "КН-45-5/1",
        "name": "Єрмоленко Владислав Ігорович",
        "course": 2,
        "subjects": {
            "Чисельні методи": 92,
            "Програмування": 88,
            "Сталий розвиток": 80
        }
    },
    103: {
        "group": "КН-45-5/2",
        "name": "Пилипчук Єлизавета Миколаївна",
        "course": 2,
        "subjects": {
            "Чисельні методи": 75,
            "Програмування": 82,
            "Сталий розвиток": 91
        }
    },
    104: {
        "group": "КН-45-5/2",
        "name": "Подоляка Ярослав Віталійович",
        "course": 1,
        "subjects": {
            "Чисельні методи": 83,
            "Програмування": 79,
            "Сталий розвиток": 85
        }
    },
    105: {
        "group": "КН-45-5/2",
        "name": "Чесной Владислав Сергійович",
        "course": 1,
        "subjects": {
            "Чисельні методи": 90,
            "Програмування": 72,
            "Сталий розвиток": 84
        }
    },
}

# Функція для перегляду всього вмісту словника - виконав Бобошко Вадим
def show_all(data):
    if not data:
        print("Словник порожній.")
    else:
        for student_id, info in data.items():
            print(f"\nID студента: {student_id}")
            print(f"Група: {info['group']}")
            print(f"ПІБ: {info['name']}")
            print(f"Курс: {info['course']}")
            print("Предмети та оцінки:")
            for subject, grade in info['subjects'].items():
                print(f"   {subject}: {grade}")

def show_by_course(data):
    course = int(input("Введіть номер курсу: "))
    print(f"\nСтуденти {course}-го курсу:")
    found = False
    for sid, info in data.items():
        if info["course"] == course:
            print(f"{sid}: {info['name']} — група {info['group']}")
            found = True
    if not found:
        print("Немає студентів цього курсу.")
def main():
    while True:
        print("\n--- МЕНЮ ---")
        print("1. Переглянути весь словник студентів")
        print("2. Додати нового студента")
        print("3. Видалити студента")
        print("4. Вивести середній бал студента")
        print("5. Знайти студента з найвищим середнім балом")
        print("6. Показати студентів певної групи")
        print("7. Показати студентів певного курсу")
        print("8. Редагувати оцінки студента")
        print("9. Редагувати курс студента")
        print("0. Вихід")

        choice = input("Ваш вибір: ")

        if choice == "1":
            show_all(students)
        elif choice == "2":
            print("Тут має бути функція додавання нового студента")
        elif choice == "3":
            print("Тут має бути функція видалення студента")
        elif choice == "4":
            print("Тут має бути функція виведення середнього балу студента")
        elif choice == "5":
            print("Тут має бути функція знаходження студента з найвищим середнім балом")
        elif choice == "6":
            print("Тут має бути функція відбору студентів певної групи")
        elif choice == "7":
            show_by_course(students)
        elif choice == "8":
            print("Тут має бути функція редагування оцінок студента")
        elif choice == "9":
            print("Тут має бути функція редагування курсу студента")
        elif choice == "0":
            print("Роботу завершено.")
            break
        else:
            print("Неправильний вибір, спробуйте ще раз!")

main()
